SET FOREIGN_KEY_CHECKS=0;

-- ----------------------------
-- Table structure for sale
-- ----------------------------
DROP TABLE IF EXISTS `sale`;
CREATE TABLE `sale` (
  `sale_id` bigint NOT NULL AUTO_INCREMENT,
  `sale_name` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `sale_phone` varchar(255) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci DEFAULT NULL,
  `createtime` datetime DEFAULT NULL,
  `updatetime` datetime DEFAULT NULL,
  `lng` double DEFAULT NULL,
  `lat` double DEFAULT NULL,
  `address` varchar(255) DEFAULT '',
  PRIMARY KEY (`sale_id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=12635346 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci ROW_FORMAT=DYNAMIC;

-- ----------------------------
-- Records of sale
-- ----------------------------
INSERT INTO `sale` VALUES ('12635266', '海王星辰连锁药店111', '17663456777', '2021-09-06 18:44:14', '2023-09-01 09:51:22', '104.99934', '30.56946', '四川省德阳市中江县仓山镇寨子顶');
INSERT INTO `sale` VALUES ('12635267', '漱玉平民大药房', '18765449999', '2021-09-06 18:44:28', '2021-09-06 18:44:28', '104.89934', '30.57046', '四川省资阳市乐至县金顺镇103县道');
INSERT INTO `sale` VALUES ('12635268', '天士力大药房', '19845699999', '2021-09-06 18:45:09', '2021-09-06 18:45:09', '103.79934', '30.58146', '四川省成都市崇州市三江街道羊江路');
INSERT INTO `sale` VALUES ('12635270', '万和大药房1', '13456578889', '2021-09-06 18:45:55', '2023-08-31 16:59:48', '103.59934', '30.60746', '四川省成都市崇州市白头镇天竺路');
INSERT INTO `sale` VALUES ('12635271', '仁和堂大药房1', '13576799991', '2021-09-06 18:46:24', '2023-09-01 09:20:33', '103.90934', '30.62746', '四川省成都市双流区九江街道元瑞家具城掌上明珠工厂直营店成都元瑞家具材料市场');
INSERT INTO `sale` VALUES ('12635280', '天一药店', '13354449778', '2021-11-18 14:54:18', '2023-03-09 14:36:31', '103.92934', '30.5575', '四川省成都市双流区东升街道大成天府景秀大成天府景秀1、3期');
INSERT INTO `sale` VALUES ('12635287', '回春药房', '12233334444', '2020-03-08 14:50:25', '2021-11-30 09:20:29', '103.94934', '30.5576', '四川省成都市双流区东升街道中国国际货运航空有限公司成都双流国际机场');
INSERT INTO `sale` VALUES ('12635288', '沁心大药房', '12233334444', '2020-03-08 14:50:26', '2021-11-30 10:38:40', '103.49934', '30.5578', '四川省成都市大邑县晋原街道盐化苏路成都冶金实验厂有限公司');
INSERT INTO `sale` VALUES ('12635293', '青春药房', '13354449778', '2023-03-08 14:48:36', '2023-03-09 14:37:00', '103.99442185375975', '30.55746799584296', '四川省成都市双流区西航港街道励行东路四川大学江安校区');
INSERT INTO `sale` VALUES ('12635294', '仲景堂000', '13354449777', '2023-03-08 15:16:59', '2023-09-01 15:45:03', '103.89442185375975', '30.646799584296', '四川省成都市双流区九江街道阿垦农场');
INSERT INTO `sale` VALUES ('12635295', '智秀大药房', '15264985021', '2023-03-08 16:13:27', '2023-09-06 17:35:13', '104.090798', '30.688991', '四川省成都市双流区九江街道阿垦农场');
INSERT INTO `sale` VALUES ('12635297', '广安堂', '1212321', '2023-03-08 16:15:41', '2023-03-08 16:15:41', '104.064155', '30.662808', '四川省成都市青羊区西御河街道西华门街24号院成都市实验小学(人民中路校区)');
INSERT INTO `sale` VALUES ('12635304', '尚品堂药房', '12312680978', '2023-03-09 09:23:05', '2023-03-09 14:38:35', '104.08895', '30.675467', '四川省成都市金牛区驷马桥街道成都马鞍北路社区');
INSERT INTO `sale` VALUES ('12635305', '暖心堂药房', '12312390860', '2023-03-09 09:23:17', '2023-03-09 14:38:43', '104.102294', '30.675003', '四川省成都市成华区猛追湾街道电子科技大学电子科技大学沙河校区');
INSERT INTO `sale` VALUES ('12635307', '朱颜药品店', '15266448855', '2023-03-09 09:25:57', '2023-09-01 09:36:30', '104.052984', '30.652199', '四川省成都市青羊区少城街道绮霞园');
INSERT INTO `sale` VALUES ('12635309', '弃疾药店', '12131414135', '2023-03-09 10:01:29', '2023-03-09 14:38:07', '104.063352', '30.637329', '四川省成都市武侯区玉林街道中学路22-附7号中学路17号院');
INSERT INTO `sale` VALUES ('12635315', '哈药', '15308891907', '2023-03-11 10:52:51', '2023-03-11 10:52:51', '104.099246', '30.655776', '四川省成都市成华区猛追湾街道锦泰公寓中国石油水碾河加油站');
INSERT INTO `sale` VALUES ('12635316', '王玉涵药店2', '13313331333', '2023-03-16 09:05:18', '2023-09-01 09:45:27', '104.003212', '30.705721', '四川省成都市金牛区金泉街道风林假日');
INSERT INTO `sale` VALUES ('12635318', '李四大药房', '133544497777', '2023-06-06 11:02:39', '2023-06-06 11:02:39', '103.99442185375975', '30.55746799584296', '四川省成都市双流区西航港街道励行东路四川大学江安校区');
INSERT INTO `sale` VALUES ('12635319', '李四大药房', '133544497777', '2023-06-06 11:25:08', '2023-06-06 11:25:08', '103.99442185375975', '30.55746799584296', '四川省成都市双流区西航港街道励行东路四川大学江安校区');
INSERT INTO `sale` VALUES ('12635341', '龙泉山大药房', '15122335544', '2023-09-01 15:45:28', '2023-09-01 15:45:28', '104.337608', '30.541705', '四川省成都市龙泉驿区山泉镇桃花故里景区龙泉山风景区');
INSERT INTO `sale` VALUES ('12635342', '成都东站大药房', '15244887744', '2023-09-06 15:38:32', '2023-09-06 15:38:32', '104.139854', '30.634259', '四川省成都市成华区保和街道成都我们的觅悦公寓梦魔方广场');
INSERT INTO `sale` VALUES ('12635343', '成都南站大药房', '15211447788', '2023-09-06 15:40:14', '2023-09-06 15:40:14', '104.065697', '30.611214', '四川省成都市武侯区火车南站街道沁园茶楼中成市场');
INSERT INTO `sale` VALUES ('12635344', '成都西站大药房', '15212365471', '2023-09-06 15:41:52', '2023-09-06 15:41:52', '103.981239', '30.687418', '四川省成都市青羊区苏坡街道金辉路中国石油联工加油站');